app/controllers/message_controller.rb

  def add
     if request.post? && session[:spy].nil? && !session[:current_user_id].nil?
       @message=Message.new(:title=>params[:title],:message=>params[:message])
        if @message.save
---
INSERT INTO "messages" ("title", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "annandnandnd"], ["message", "sndnsndnd"], ["created_at", "2015-02-15 08:32:55.043416"], ["updated_at", "2015-02-15 08:32:55.043416"]]


        if request.post? && !session[:spy].nil?
          @message=Secret.new(:title=>params[:title],:message=>params[:message])
          if @message.save
---
INSERT INTO "secrets" ("title", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "nikhil"], ["message", "secret message"], ["created_at", "2015-02-18 21:05:16.107484"], ["updated_at", "2015-02-18 21:05:16.107484"]]

  def list
    if !session[:current_user_id].nil? && session[:spy].nil?
      #@user = User.find(session[:user_id)
      @message = Message.all
      render "/message/list"
      if(session[:knock].nil?)
        session[:knock]=""
        session[:knock]=session[:knock]+"3"
      else
        if(session[:knock].length < 4)
            session[:knock]=session[:knock]+"3"
        end
        if(session[:knock].length == 4)
          if(session[:sequence]==session[:knock])
            session[:spy]=true
          else
            @jugaad=session[:knock].split("")
            @replace=@jugaad[1]+@jugaad[2]+@jugaad[3]
            session[:replace]=@replace
            session[:knock]=""
            session[:knock]=session[:knock]+@replace
          end
        end
      end
    elsif !session[:current_user_id].nil? && !session[:spy].nil?
      @message=Secret.all
---
SELECT "messages".* FROM "messages"
SELECT "secrets".* FROM "secrets"