app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "test100"]]
---
  def login
  #checks post method
    if request.post?
      @user=User.find_by_username(params[:username])

SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT 1
SELECT  1 AS one FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "nikhil"]]
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-02-15 00:10:43.644773"], ["updated_at", "2015-02-15 00:10:43.644773"]]
---
  def register
   if request.post?
    if params[:password]== params[:password_confirm] && !User.where(:username => params[:username]).exists?
     @user=User.new(:username=>params[:username],:password=>params[:password],:password_confirm=>params[:password_confirm])
     if @user.save